---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.FamilyConnectorDeletedError
source: html/2d7dd9b7-cdc9-b413-11e8-cd5e7cf75026.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.FamilyConnectorDeletedError Property

The family Connector has been modified so the connection is invalid.

## Syntax (C#)
```csharp
public static FailureDefinitionId FamilyConnectorDeletedError { get; }
```